backend/app/controllers/heropowers_controller.rb

SELECT "heropowers".* FROM "heropowers"
---
  def index
    @heropowers = Heropower.all

INSERT INTO "heropowers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "touhg"], ["hero_id", 1], ["power_id", 1], ["created_at", "2023-03-26 08:05:43.826479"], ["updated_at", "2023-03-26 08:05:43.826479"]]
---
  def create
    @heropower = Heropower.new(heropower_params)

    respond_to do |format|
      if @heropower.save

DELETE FROM "heropowers" WHERE "heropowers"."id" = ?  [["id", 1]]
---
  def destroy
    @heropower.destroy

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "heropowers".* FROM "heropowers" WHERE "heropowers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_heropower
      @heropower = Heropower.find(params[:id])