backend/app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
  def index
    heroes = Hero.all

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def show
  hero = Hero.find_by(id: params[:id])

INSERT INTO "heros" ("name", "super_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mad"], ["super_name", "ddkkl"], ["created_at", "2023-03-26 08:02:47.474487"], ["updated_at", "2023-03-26 08:02:47.474487"]]
---
  def create
    @hero = Hero.new(hero_params)

    respond_to do |format|
      if @hero.save

DELETE FROM "heros" WHERE "heros"."id" = ?  [["id", 2]]
---
  def destroy
    @hero.destroy

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hero
      @hero = Hero.find(params[:id])