backend/app/controllers/powers_controller.rb

  def show
    power = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]