backend/app/controllers/powers_controller.rb

  def index
    @powers = Power.all
---
SELECT "powers".* FROM "powers"

  def create
    @power = Power.new(power_params)

    respond_to do |format|
      if @power.save
---
INSERT INTO "powers" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "er"], ["description", "rgtgtggtg"], ["created_at", "2023-03-26 08:05:22.791397"], ["updated_at", "2023-03-26 08:05:22.791397"]]

    def set_power
      @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]