app/controllers/heropowers_controller.rb

  def create
    hero_power = HeroPower.create(hero_power_params)
---
INSERT INTO "heropowers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "touhg"], ["hero_id", 1], ["power_id", 1], ["created_at", "2023-03-26 08:05:43.826479"], ["updated_at", "2023-03-26 08:05:43.826479"]]